{
    "queries": {
        "cde8b9a3-2bd6-4bb6-a751-9f2396ba2648": "How does the Facial Treatment Essence by SK-II promote skin cell renewal and improve radiance?",
        "2923d843-718a-4f84-a731-1acde5fa25e3": "What are the key benefits of using LA MER's The Moisturizing Soft Cream according to the description provided?",
        "1becbd1d-8a33-4ab9-bb5f-52290ee65e12": "How does the GenOptics Aura Essence Serum target dark spots and dullness in the skin?",
        "c73f9521-9f90-4ae5-aa0b-e22d57f565c9": "What are the key ingredients in the SK-II Facial Treatment Essence Mini?",
        "4d9b72d7-3cf1-43aa-818b-fe0c46722c98": "What skin types is the Facial Treatment Essence Mini suitable for?",
        "a6a5e463-31e2-4f9c-87a5-3925ab899e03": "What is the size of the travel-sized version of the essence?",
        "e2a9f5da-b371-4ba7-9ef5-47e75dbfea3b": "How does the price of the Facial Treatment Essence Mini compare to the full-sized version?",
        "b51028c1-d36b-4610-89f9-834f1529c0de": "What are the benefits of using the SK-II Facial Treatment Essence Mini?",
        "84447cae-8ce1-4852-9db6-fb5a3ea63f6f": "How does The Moisturizing Cool Gel Cream by LA MER cater to different skin types?",
        "3fd17768-7c22-462d-affd-6b7a7de269b1": "What is the key feature of the Ultra Facial Oil-Free Gel-Cream moisturizer?",
        "7287412e-7ebc-40ef-b06c-5a3585faa656": "What skin types is the Ultra Facial Oil-Free Gel-Cream moisturizer ideal for?",
        "c4123d7f-0d4f-4be5-8551-5ebf43f99044": "What is the main ingredient in the Ultra Facial Oil-Free Gel-Cream moisturizer that helps maintain skin's moisture balance?",
        "de985e1c-61df-4dfa-8ec7-db0565ea0739": "How long does the Ultra Facial Oil-Free Gel-Cream moisturizer provide hydration for?",
        "3cd9a70d-f14c-41d2-8eaa-849801e9eb34": "What is the size of the Ultra Facial Oil-Free Gel-Cream moisturizer?",
        "ebd5689f-6891-4ba1-94d2-9c53ea0407c1": "What are the key ingredients in La Mer's The Moisturizing Soft Lotion?",
        "a8448e9b-13d5-48fd-83cc-f7de277eaf33": "What skin types is The Moisturizing Soft Lotion suitable for?",
        "79fb9a92-0fa1-482f-a88a-99e591d8107e": "Describe the texture of The Moisturizing Soft Lotion.",
        "e75e87b9-545f-41d3-b938-e086864612e5": "What is the size of the container for The Moisturizing Soft Lotion?",
        "907dc40e-8fcd-4371-89c3-2982485b61e3": "How does the miracle broth in The Moisturizing Soft Lotion contribute to its benefits?",
        "88126582-ce2e-454f-8e08-05862c67b49d": "How does the Resilience Lift Night Lifting/Firming Face and Neck Creme work to counter the effects of gravity and loss of elasticity on the skin?",
        "8c13629b-acff-437d-be90-3a208bd5912e": "What are the key ingredients in the Ultra Facial Moisturizer by KIEHL'S SINCE 1851?",
        "cf2d5621-9759-4eab-be44-34c8a353a526": "What skin types is the Ultra Facial Moisturizer suitable for?",
        "d6d9a099-bdcf-49b6-9606-58c74ef2dda3": "What is the size of the Ultra Facial Moisturizer?",
        "f307886d-fe96-42e5-85e5-fa1d9cf890de": "How does the Ultra Facial Moisturizer provide hydration without heaviness?",
        "fb0d5da3-d8f8-422d-b500-e21083192e92": "What is the price of the Ultra Facial Moisturizer?",
        "ad878afd-93b5-4246-930f-84364f0141d0": "How do the Advanced Night Repair Intensive Recovery Ampoules work to repair skin overnight?",
        "dcfb6577-9815-4dd0-b004-8a36baf13492": "How does the Revitalizing Supreme+ Global Anti-Aging Cell Power Creme SPF 15 help reduce the appearance of lines and wrinkles?",
        "75c9b270-350e-4572-bafd-c52ed7d850f9": "What is the SPF protection level of the Ultra Facial Cream SPF 30?",
        "43a9b257-46df-458f-b936-ac8faad8d5db": "What are the key ingredients in the Ultra Facial Cream SPF 30?",
        "75fb03f2-9bf7-46ed-93fe-874ce18fbeb1": "How does the Ultra Facial Cream SPF 30 help maintain moisture balance in the skin?",
        "df2d1627-e109-4b1a-bd8b-fc6bb6415ae1": "What skin types is the Ultra Facial Cream SPF 30 suitable for?",
        "bd161902-aa37-4ec5-a87d-dff960064ff7": "What is the size of the Ultra Facial Cream SPF 30?",
        "ee004c40-b8cd-4427-9ac3-b42498c5a28a": "How does the SK-II Facial Treatment Mask claim to benefit the skin in just one application?",
        "a5a4951c-3407-4ce6-8ad9-b7a28205285c": "How does the Overnight Miracle Mask work to improve the skin while you sleep?",
        "79f677f3-f185-463f-b6ad-33c03562fcbe": "What key ingredient is infused in the Overnight Miracle Mask to replenish moisture and restore skin's natural radiance?",
        "66653e15-ea55-4adc-8540-841237b22ac3": "What skin types is the Overnight Miracle Mask suitable for?",
        "43b61d98-dca5-4c13-b08e-e6ee401544ee": "What is the size of the Overnight Miracle Mask?",
        "3c740c85-a010-42c0-b76e-9f4d50363335": "Can you name one specific ingredient listed in the Overnight Miracle Mask's formula?",
        "9c31a606-ff7e-4a69-a095-5107ad75f1db": "What are the key ingredients in the Calendula & Aloe Soothing Hydration Mask by KIEHL'S SINCE 1851?",
        "99aecb12-d3d8-482b-9f6d-2d7e107c701e": "What skin types is the Calendula & Aloe Soothing Hydration Mask suitable for?",
        "466f5200-6bcf-44b0-b446-24c39bbb21fb": "How does the Calendula & Aloe Soothing Hydration Mask provide hydration and soothing benefits to the skin?",
        "5971b1ce-82e0-419a-9605-9508ec6367d6": "What is the size of the Calendula & Aloe Soothing Hydration Mask?",
        "b1d1eddb-d5ec-4f34-810b-7cd22b86e6f8": "How does the presence of calendula flower petals and aloe vera in the mask contribute to its effectiveness for dry, sensitive, or irritated skin?",
        "3069f2f4-6abd-41c9-a86d-51d98e5623e5": "What are the key ingredients in the SK-II Brightening Derm Revival Mask and how do they contribute to its brightening and skin-evening effects?",
        "ea5eb4a1-8f4f-4a81-9ff9-fd63112b0da2": "What are the key ingredients in the Ginger Leaf & Hibiscus Firming Mask?",
        "d2f91b1b-dc80-48f4-b6c4-56d76e9e8186": "How does the Ginger Leaf & Hibiscus Firming Mask aim to improve the skin's appearance?",
        "343384ce-00de-4987-8a56-f8edd6671a1e": "What skin types is the Ginger Leaf & Hibiscus Firming Mask suitable for?",
        "8ff27994-d73d-48b4-b9f5-55250e7eaa82": "What is the size of the Ginger Leaf & Hibiscus Firming Mask?",
        "968c06f7-a856-456a-bf2e-782f00bc1032": "What is the price of the Ginger Leaf & Hibiscus Firming Mask?",
        "02a163a0-2637-46e8-9d2a-18fc1b648e48": "How is the firming effect of the Ginger Leaf & Hibiscus Firming Mask described in the description?",
        "2a59644c-1ade-4c7b-822f-ef5ea1700a81": "What brand manufactures the Ginger Leaf & Hibiscus Firming Mask?",
        "ca162937-0911-4ab6-94a7-6c4e36dc5624": "What is the overall rank of the Ginger Leaf & Hibiscus Firming Mask based on customer reviews?",
        "95dbe1eb-0960-41f6-8c1f-62a3d70f900c": "Can you name one of the natural extracts used in the formulation of the Ginger Leaf & Hibiscus Firming Mask?",
        "03dc8e5d-c264-42d9-989b-5efca71e00d5": "How does the Ginger Leaf & Hibiscus Firming Mask help reduce the appearance of fine lines and wrinkles?",
        "a231c44f-24ce-49d7-988b-93032badd404": "How does the Treatment Lotion Hydrating Mask by LA MER deliver intense moisture and renewal to the skin?",
        "7f4cdd5d-4c1a-4b5e-ad50-0e14951de6af": "What are the key ingredients in the Treatment Lotion Hydrating Mask?",
        "5132a7f3-a195-4de5-bbc9-9ebf66498853": "How many sheets are included in one pack of the Treatment Lotion Hydrating Mask?",
        "a76e0d1b-b1e4-470c-b0a8-08b564dba19e": "Which skin types is the Treatment Lotion Hydrating Mask suitable for?",
        "5d5c339d-02d2-4825-a1e2-f151af036a11": "What is the main purpose of the innovative hydrating sheet masks infused with La Mer's treatment lotion and miracle broth?",
        "72bd4877-9348-4c02-bbf2-99a8409e6399": "How does the Advanced Night Repair Concentrated Recovery Eye Mask target signs of fatigue and aging around the delicate eye area?",
        "4335195d-3a23-49e3-9780-5a31b3591b79": "What are the key ingredients in the Cilantro & Orange Extract Pollutant Defending Mask by KIEHL'S SINCE 1851?",
        "a94f7e4f-e20e-4fa7-b207-86715cf3521c": "How does the Cilantro & Orange Extract Pollutant Defending Mask help defend against environmental pollutants?",
        "fcf2a203-98a3-4173-a8d3-08eed693bfc7": "What skin types is the Cilantro & Orange Extract Pollutant Defending Mask suitable for?",
        "ed0f83be-7e48-41fa-b278-050e5a18f601": "What is the size of the Cilantro & Orange Extract Pollutant Defending Mask?",
        "f2a4f905-f797-415a-b708-39f0ce389dc1": "How does the Cilantro & Orange Extract Pollutant Defending Mask work to remove impurities and promote clearer, healthier-looking skin?",
        "0d4ce49a-bf37-45c7-b030-2e97b2d6d3a8": "Explain the key benefits of the Advanced Night Repair Eye Concentrate Matrix.",
        "df35b2a2-f884-439f-a58c-94f7b10fda23": "List three key ingredients in the Advanced Night Repair Eye Concentrate Matrix and explain their roles in reducing puffiness and fine lines.",
        "9cc3791a-8030-487e-a01a-9ddee6022fd3": "What skin types is the Advanced Night Repair Eye Concentrate Matrix suitable for?",
        "729ea5b4-912a-4a1d-9bc1-e1b7d3fb735d": "Describe the technology used in the Advanced Night Repair Eye Concentrate Matrix that provides 360° eye support.",
        "8025340d-d7fe-4275-9870-92cd1c05782f": "What is the size of the Advanced Night Repair Eye Concentrate Matrix product?",
        "ed2de409-6add-4b23-a91d-b023ade0e8c4": "What are the key benefits of the Advanced Night Repair Eye Serum Synchronized Complex II according to the description provided?",
        "a5447acd-0d06-408d-bd22-0ef49bddef6c": "What are the key ingredients in the Youth Dose Eye Treatment by KIEHL'S SINCE 1851?",
        "cc7014fc-18c6-40d4-8382-ac6be1110199": "How does the Youth Dose Eye Treatment aim to improve the appearance of the under-eye area?",
        "4cb62a01-c873-4859-89cd-4e4d872bd6b1": "What skin types is the Youth Dose Eye Treatment suitable for?",
        "15180ee0-8b6d-4eb5-89b2-93ebb3131f37": "What size is the Youth Dose Eye Treatment available in?",
        "61551963-6c0e-4325-aac1-7fd9f29e2db2": "How does the Youth Dose Eye Treatment address concerns such as dark circles, fine lines, and puffiness around the eyes?",
        "0df6b1ec-8b22-4841-b9cf-759ef73a098c": "How does the Powerful-Strength Line-Reducing Eye-Brightening Concentrate work to reduce the appearance of lines and dark circles around the eyes?",
        "69349660-c317-4116-9672-984fa70daf12": "How does the Clearly Corrective™ Dark Circle Perfector work to improve the appearance of dark circles over time?"
    },
    "responses": {
        "cde8b9a3-2bd6-4bb6-a751-9f2396ba2648": "The Facial Treatment Essence by SK-II promotes skin cell renewal and improves radiance through its key ingredient, Pitera. Pitera is a bio-ingredient rich in vitamins, minerals, and amino acids that helps to stimulate skin cell renewal, reduce wrinkles, refine texture, and enhance radiance. This essence contains 90% Pitera, which works to nourish and revitalize the skin, resulting in a more radiant and youthful complexion.",
        "2923d843-718a-4f84-a731-1acde5fa25e3": "The key benefits of using LA MER's The Moisturizing Soft Cream include delivering healing moisture, visibly diminishing fine lines, helping skin look firmer, healthier, and revitalized, and strengthening the skin barrier.",
        "1becbd1d-8a33-4ab9-bb5f-52290ee65e12": "The GenOptics Aura Essence Serum targets dark spots and dullness in the skin by using SK-II's signature Pitera ingredient, which helps reduce the appearance of melanin and promote a more radiant, even-toned complexion. Additionally, the serum contains ingredients such as Niacinamide, Panthenol, and Prunus Mume Fruit Extract, which are known for their brightening and skin tone-evening properties.",
        "c73f9521-9f90-4ae5-aa0b-e22d57f565c9": "The key ingredients in the SK-II Facial Treatment Essence Mini are Galactomyces Ferment Filtrate (Pitera), Butylene Glycol, Pentylene Glycol, Water, Sodium Benzoate, Methylparaben, and Sorbic Acid.",
        "4d9b72d7-3cf1-43aa-818b-fe0c46722c98": "The Facial Treatment Essence Mini is suitable for all skin types, including Dry, Normal, Oily, and Sensitive skin.",
        "a6a5e463-31e2-4f9c-87a5-3925ab899e03": "The size of the travel-sized version of the essence is 2.5 oz (75ml).",
        "e2a9f5da-b371-4ba7-9ef5-47e75dbfea3b": "The price of the Facial Treatment Essence Mini is not directly compared to the full-sized version in the provided context information.",
        "b51028c1-d36b-4610-89f9-834f1529c0de": "The benefits of using the SK-II Facial Treatment Essence Mini include skin-renewing properties, portability for travel, and affordability in a smaller size.",
        "84447cae-8ce1-4852-9db6-fb5a3ea63f6f": "The Moisturizing Cool Gel Cream by LA MER is suitable for normal to oily skin types. It is a lightweight gel cream that helps reduce shine while providing hydration, making it ideal for those with normal to oily skin.",
        "3fd17768-7c22-462d-affd-6b7a7de269b1": "The key feature of the Ultra Facial Oil-Free Gel-Cream moisturizer is its shine-reducing, oil-free formula that provides 24-hour hydration without greasiness.",
        "7287412e-7ebc-40ef-b06c-5a3585faa656": "The Ultra Facial Oil-Free Gel-Cream moisturizer is ideal for oily and normal skin types.",
        "c4123d7f-0d4f-4be5-8551-5ebf43f99044": "The main ingredient in the Ultra Facial Oil-Free Gel-Cream moisturizer that helps maintain skin's moisture balance is Glacial Glycoprotein.",
        "de985e1c-61df-4dfa-8ec7-db0565ea0739": "The Ultra Facial Oil-Free Gel-Cream moisturizer provides 24-hour hydration.",
        "3cd9a70d-f14c-41d2-8eaa-849801e9eb34": "The size of the Ultra Facial Oil-Free Gel-Cream moisturizer is 1.7 oz (50ml).",
        "ebd5689f-6891-4ba1-94d2-9c53ea0407c1": "Some key ingredients in La Mer's The Moisturizing Soft Lotion include Algae (Seaweed) Extract, Petrolatum, Butyrospermum Parkii (Shea Butter), Cyclopentasiloxane, Dimethicone, Sesamum Indicum (Sesame) Seed Oil, Eucalyptus Globulus (Eucalyptus) Leaf Oil, Tocopheryl Succinate, Niacin, Water, Caffeine, Sodium Hyaluronate, and Tetrahexyldecyl Ascorbate.",
        "a8448e9b-13d5-48fd-83cc-f7de277eaf33": "The Moisturizing Soft Lotion is suitable for normal to combination skin types.",
        "79fb9a92-0fa1-482f-a88a-99e591d8107e": "The texture of The Moisturizing Soft Lotion is described as lightweight and fast-absorbing, with a more fluid consistency suitable for normal to combination skin.",
        "e75e87b9-545f-41d3-b938-e086864612e5": "The size of the container for The Moisturizing Soft Lotion is 1.7 oz (50ml).",
        "907dc40e-8fcd-4371-89c3-2982485b61e3": "The miracle broth in The Moisturizing Soft Lotion delivers La Mer's transformative benefits by providing hydration, nourishment, and overall improvement to the skin. It helps to moisturize and revitalize the skin, making it suitable for normal to combination skin types.",
        "88126582-ce2e-454f-8e08-05862c67b49d": "The Resilience Lift Night Lifting/Firming Face and Neck Creme works to counter the effects of gravity and loss of elasticity on the skin by using photo-activated lifters and advanced technology. These ingredients help lift, firm, and repair the skin while you sleep, providing anti-aging benefits to combat the effects of gravity and loss of elasticity.",
        "8c13629b-acff-437d-be90-3a208bd5912e": "Some key ingredients in the Ultra Facial Moisturizer by KIEHL'S SINCE 1851 include Water, Squalane, Glycerin, Peg-100 Stearate, Glyceryl Stearate, Butylene Glycol, Triethanolamine, Phenoxyethanol, Sorbitan Oleate, Carbomer, Methylparaben, Propylparaben, Stearic Acid, Beeswax, Myristyl Alcohol, Sweet Almond Oil, Apricot Kernel Oil, Tocopherol, and Avocado Oil.",
        "cf2d5621-9759-4eab-be44-34c8a353a526": "The Ultra Facial Moisturizer is suitable for all skin types, including dry, normal, oily, and sensitive skin.",
        "d6d9a099-bdcf-49b6-9606-58c74ef2dda3": "The size of the Ultra Facial Moisturizer is 2.5 oz (75ml).",
        "f307886d-fe96-42e5-85e5-fa1d9cf890de": "The Ultra Facial Moisturizer provides hydration without heaviness by using a blend of botanical extracts and emollients in its formula. These ingredients help to nourish and hydrate the skin without leaving a heavy or greasy feeling.",
        "fb0d5da3-d8f8-422d-b500-e21083192e92": "The price of the Ultra Facial Moisturizer is $29.",
        "ad878afd-93b5-4246-930f-84364f0141d0": "The Advanced Night Repair Intensive Recovery Ampoules work by providing intensive treatment to boost skin's natural repair processes and strengthen the moisture barrier. The single-dose ampoules help repair the skin overnight, allowing for powerful recovery and rejuvenation.",
        "dcfb6577-9815-4dd0-b004-8a36baf13492": "The Revitalizing Supreme+ Global Anti-Aging Cell Power Creme SPF 15 helps reduce the appearance of lines and wrinkles by promoting the skin's natural collagen production, resulting in a firmer and more youthful appearance. Additionally, the SPF protection in the moisturizer helps prevent further damage to the skin from sun exposure, which can contribute to the formation of lines and wrinkles.",
        "75c9b270-350e-4572-bafd-c52ed7d850f9": "The SPF protection level of the Ultra Facial Cream SPF 30 is 30.",
        "43a9b257-46df-458f-b936-ac8faad8d5db": "Some key ingredients in the Ultra Facial Cream SPF 30 are Water, Glycerin, Squalane, Dimethicone, Tocopherol, Ophiopogon Japonicus Root Extract, Ectoin, and Hyaluronic Acid.",
        "75fb03f2-9bf7-46ed-93fe-874ce18fbeb1": "The Ultra Facial Cream SPF 30 helps maintain moisture balance in the skin by providing lasting hydration without greasiness.",
        "df2d1627-e109-4b1a-bd8b-fc6bb6415ae1": "The Ultra Facial Cream SPF 30 is suitable for all skin types, including Dry, Normal, Oily, and Sensitive skin.",
        "bd161902-aa37-4ec5-a87d-dff960064ff7": "The size of the Ultra Facial Cream SPF 30 is 1.7 oz (50ml).",
        "ee004c40-b8cd-4427-9ac3-b42498c5a28a": "The SK-II Facial Treatment Mask claims to visibly brighten, hydrate, and rejuvenate the skin in just one application.",
        "a5a4951c-3407-4ce6-8ad9-b7a28205285c": "The Overnight Miracle Mask works to replenish moisture, smooth texture, and restore skin's natural radiance by morning. It is infused with Pitera and works overnight to provide these benefits while you sleep.",
        "79f677f3-f185-463f-b6ad-33c03562fcbe": "Pitera",
        "66653e15-ea55-4adc-8540-841237b22ac3": "The Overnight Miracle Mask is suitable for all skin types, including dry, normal, oily, and sensitive skin.",
        "43b61d98-dca5-4c13-b08e-e6ee401544ee": "The size of the Overnight Miracle Mask is 2.8 oz (80g).",
        "3c740c85-a010-42c0-b76e-9f4d50363335": "One specific ingredient listed in the Overnight Miracle Mask's formula is Galactomyces Ferment Filtrate.",
        "9c31a606-ff7e-4a69-a095-5107ad75f1db": "The key ingredients in the Calendula & Aloe Soothing Hydration Mask by KIEHL'S SINCE 1851 are Aloe Barbadensis Leaf Juice, Calendula Officinalis Flower, Calendula Officinalis Flower Extract, Citrus Limon Peel Oil, Lemon Peel Oil, Paeonia Suffruticosa Root Extract, Scutellaria Baicalensis Root Extract, Citrus Aurantium Dulcis (Orange) Peel Oil, Tocopheryl Acetate, Cassia Angustifolia Seed Polysaccharide, Pelargonium Graveolens Flower Oil, Anthemis Nobilis Flower Oil, Artemisia Absinthium Extract, and Tocopherol.",
        "99aecb12-d3d8-482b-9f6d-2d7e107c701e": "The Calendula & Aloe Soothing Hydration Mask is suitable for dry, normal, oily, and sensitive skin types.",
        "466f5200-6bcf-44b0-b446-24c39bbb21fb": "The Calendula & Aloe Soothing Hydration Mask provides hydration and soothing benefits to the skin through its ingredients such as Aloe Barbadensis Leaf Juice, Calendula Officinalis Flower Extract, and Citrus Limon Peel Oil. These ingredients help to hydrate and calm dry, sensitive, or irritated skin, leaving it feeling replenished and calm. The gel mask also contains glycerin and various plant extracts that contribute to the soothing and hydrating effects on the skin.",
        "5971b1ce-82e0-419a-9605-9508ec6367d6": "The size of the Calendula & Aloe Soothing Hydration Mask is 3.4 oz (100ml).",
        "b1d1eddb-d5ec-4f34-810b-7cd22b86e6f8": "The presence of calendula flower petals and aloe vera in the mask contributes to its effectiveness for dry, sensitive, or irritated skin by providing immediate soothing hydration. Calendula is known for its calming properties, while aloe vera is hydrating and soothing, making them both beneficial ingredients for replenishing and calming the skin.",
        "3069f2f4-6abd-41c9-a86d-51d98e5623e5": "The key ingredients in the SK-II Brightening Derm Revival Mask are Galactomyces Ferment Filtrate (Pitera), Niacinamide, Ascorbyl Glucoside, and Hexapeptide-11. \n\n- Galactomyces Ferment Filtrate (Pitera) is known for its brightening and hydrating properties, helping to improve skin tone and texture.\n- Niacinamide is a form of Vitamin B3 that helps to reduce the appearance of dark spots and hyperpigmentation, promoting a more even skin tone.\n- Ascorbyl Glucoside is a stable form of Vitamin C that has brightening and antioxidant properties, helping to improve skin radiance and reduce dullness.\n- Hexapeptide-11 is a peptide that can help to improve skin elasticity and firmness, contributing to a more youthful and radiant complexion. \n\nTogether, these ingredients work synergistically to brighten and even the skin tone, diminish dark spots, and reduce dullness for a more radiant complexion.",
        "ea5eb4a1-8f4f-4a81-9ff9-fd63112b0da2": "Some key ingredients in the Ginger Leaf & Hibiscus Firming Mask include ginger leaf extract, hibiscus seed extract, mango seed butter, shea butter, sweet almond oil, turmeric root extract, lavender oil, and basil flower/leaf extract.",
        "d2f91b1b-dc80-48f4-b6c4-56d76e9e8186": "The Ginger Leaf & Hibiscus Firming Mask aims to improve the skin's appearance by helping to visibly improve skin's elasticity and reduce the appearance of fine lines and wrinkles.",
        "343384ce-00de-4987-8a56-f8edd6671a1e": "The Ginger Leaf & Hibiscus Firming Mask is suitable for all skin types, including dry, normal, oily, and sensitive skin.",
        "8ff27994-d73d-48b4-b9f5-55250e7eaa82": "The size of the Ginger Leaf & Hibiscus Firming Mask is 3.5 oz (100ml).",
        "968c06f7-a856-456a-bf2e-782f00bc1032": "The price of the Ginger Leaf & Hibiscus Firming Mask is $54.",
        "02a163a0-2637-46e8-9d2a-18fc1b648e48": "The firming effect of the Ginger Leaf & Hibiscus Firming Mask is described as an instant firming effect in the description.",
        "2a59644c-1ade-4c7b-822f-ef5ea1700a81": "KIEHL'S SINCE 1851",
        "ca162937-0911-4ab6-94a7-6c4e36dc5624": "The overall rank of the Ginger Leaf & Hibiscus Firming Mask based on customer reviews is 4.4.",
        "95dbe1eb-0960-41f6-8c1f-62a3d70f900c": "Hibiscus seed extract",
        "03dc8e5d-c264-42d9-989b-5efca71e00d5": "The Ginger Leaf & Hibiscus Firming Mask helps reduce the appearance of fine lines and wrinkles by improving skin's elasticity. This is achieved through the formulation of ginger leaf and hibiscus seed extract in the mask, which work together to visibly improve skin's firmness and reduce the signs of aging.",
        "a231c44f-24ce-49d7-988b-93032badd404": "The Treatment Lotion Hydrating Mask by LA MER delivers intense moisture and renewal to the skin through innovative hydrating sheet masks infused with La Mer's treatment lotion and miracle broth. These masks are designed to transform the skin in just one use, providing deep hydration and rejuvenation.",
        "7f4cdd5d-4c1a-4b5e-ad50-0e14951de6af": "Some key ingredients in the Treatment Lotion Hydrating Mask include Algae Extract, Glycerin, Sesame Seed Oil, Sunflower Seedcake, Sweet Almond Seed Meal, Eucalyptus Leaf Oil, Vitamin E, Niacin, Lime Peel Extract, Soybean Seed Extract, Sea Salt, Caffeine, Hyaluronic Acid, and various minerals such as Copper, Calcium, Magnesium, and Zinc Gluconate.",
        "5132a7f3-a195-4de5-bbc9-9ebf66498853": "There are 6 sheets included in one pack of the Treatment Lotion Hydrating Mask.",
        "a76e0d1b-b1e4-470c-b0a8-08b564dba19e": "The Treatment Lotion Hydrating Mask is suitable for all skin types, including dry, normal, oily, and sensitive skin.",
        "5d5c339d-02d2-4825-a1e2-f151af036a11": "The main purpose of the innovative hydrating sheet masks infused with La Mer's treatment lotion and miracle broth is to deliver intense moisture and renewal, transforming skin in just one use.",
        "72bd4877-9348-4c02-bbf2-99a8409e6399": "The Advanced Night Repair Concentrated Recovery Eye Mask targets signs of fatigue and aging around the delicate eye area by reducing puffiness, fine lines, and dark circles for a refreshed appearance. It contains ingredients such as caffeine, coffee seed extract, chamomile flower extract, and squalane that help to rejuvenate and revitalize the skin around the eyes.",
        "4335195d-3a23-49e3-9780-5a31b3591b79": "Some key ingredients in the Cilantro & Orange Extract Pollutant Defending Mask by KIEHL'S SINCE 1851 include cilantro seed oil, orange fruit water, shea butter, glycerin, apricot kernel oil, olive fruit oil, squalane, neohesperidin dihydrochalcone, ferulic acid, lavender oil, peppermint oil, rice bran oil, and various fruit extracts such as Vaccinium Myrtillus, Sugar Cane, Lemon, and Sugar Maple.",
        "a94f7e4f-e20e-4fa7-b207-86715cf3521c": "The Cilantro & Orange Extract Pollutant Defending Mask helps defend against environmental pollutants by using cilantro and orange extract to purify the skin and gently remove impurities, resulting in clearer and healthier-looking skin.",
        "fcf2a203-98a3-4173-a8d3-08eed693bfc7": "The Cilantro & Orange Extract Pollutant Defending Mask is suitable for all skin types, including dry, normal, oily, and sensitive skin.",
        "ed0f83be-7e48-41fa-b278-050e5a18f601": "The size of the Cilantro & Orange Extract Pollutant Defending Mask is 2.5 oz (75ml).",
        "f2a4f905-f797-415a-b708-39f0ce389dc1": "The Cilantro & Orange Extract Pollutant Defending Mask works by using cilantro and orange extract to help defend against environmental pollutants. These ingredients also help in gently removing impurities from the skin, resulting in clearer and healthier-looking skin.",
        "0d4ce49a-bf37-45c7-b030-2e97b2d6d3a8": "The key benefits of the Advanced Night Repair Eye Concentrate Matrix include visibly reducing puffiness, fine lines, and crepiness around the eyes. It also provides 360° eye support for a more lifted appearance.",
        "df35b2a2-f884-439f-a58c-94f7b10fda23": "1. Caffeine: Caffeine is known for its ability to constrict blood vessels, which can help reduce puffiness around the eyes. By constricting the blood vessels, caffeine can help reduce the appearance of dark circles and puffiness, giving the eyes a more refreshed and awake look.\n\n2. Sodium Hyaluronate: Sodium Hyaluronate is a form of hyaluronic acid, which is a powerful humectant that can hold up to 1000 times its weight in water. This ingredient helps to hydrate and plump the skin around the eyes, reducing the appearance of fine lines and wrinkles. By keeping the skin hydrated, sodium hyaluronate can also help improve the overall texture and smoothness of the skin.\n\n3. Vitamin E (Tocopheryl Acetate): Vitamin E is a powerful antioxidant that can help protect the skin from free radical damage, which can contribute to the formation of fine lines and wrinkles. By neutralizing free radicals, vitamin E helps to prevent premature aging and maintain the skin's elasticity. This can result in a smoother and more youthful appearance around the eyes.",
        "9cc3791a-8030-487e-a01a-9ddee6022fd3": "The Advanced Night Repair Eye Concentrate Matrix is suitable for dry, normal, and oily skin types.",
        "729ea5b4-912a-4a1d-9bc1-e1b7d3fb735d": "The Advanced Night Repair Eye Concentrate Matrix uses a matrix technology that provides 360° eye support for a more lifted appearance.",
        "8025340d-d7fe-4275-9870-92cd1c05782f": "The size of the Advanced Night Repair Eye Concentrate Matrix product is 0.5 oz (15ml).",
        "ed2de409-6add-4b23-a91d-b023ade0e8c4": "The key benefits of the Advanced Night Repair Eye Serum Synchronized Complex II are reducing the appearance of fine lines, wrinkles, and dark circles, as well as hydrating and fortifying the delicate skin around the eyes.",
        "a5447acd-0d06-408d-bd22-0ef49bddef6c": "The key ingredients in the Youth Dose Eye Treatment by KIEHL'S SINCE 1851 are pro-retinol, vitamin C, and grape seed extract.",
        "cc7014fc-18c6-40d4-8382-ac6be1110199": "The Youth Dose Eye Treatment aims to improve the appearance of the under-eye area by diminishing dark circles, fine lines, and puffiness. It is formulated with pro-retinol, vitamin C, and grape seed extract to help achieve these results.",
        "4cb62a01-c873-4859-89cd-4e4d872bd6b1": "The Youth Dose Eye Treatment is suitable for all skin types, including Dry, Normal, Oily, and Sensitive skin.",
        "15180ee0-8b6d-4eb5-89b2-93ebb3131f37": "The Youth Dose Eye Treatment is available in a size of 0.5 oz (15ml).",
        "61551963-6c0e-4325-aac1-7fd9f29e2db2": "The Youth Dose Eye Treatment addresses concerns such as dark circles, fine lines, and puffiness around the eyes by being formulated with pro-retinol, vitamin C, and grape seed extract. These ingredients work together to help diminish dark circles, fine lines, and puffiness, resulting in brighter and smoother under-eye area.",
        "0df6b1ec-8b22-4841-b9cf-759ef73a098c": "The Powerful-Strength Line-Reducing Eye-Brightening Concentrate works by combining powerful vitamin C with illuminating minerals to help visibly reduce the appearance of lines and dark circles around the eyes. The vitamin C helps to brighten the skin and improve the overall appearance, while the illuminating minerals work to reduce the visibility of dark circles, resulting in brighter-looking eyes.",
        "69349660-c317-4116-9672-984fa70daf12": "The Clearly Corrective™ Dark Circle Perfector works to improve the appearance of dark circles over time by delivering skincare benefits that help to reduce the appearance of dark circles. The product contains ingredients such as 3-O-Ethyl Ascorbic Acid, Zinc Pca, Caffeine, and Glycyrrhiza Glabra (Licorice) Root Extract, which work together to target dark circles and improve their appearance with continued use."
    }
}